--- USE db ---
USE s_matskiv_module_3;
GO

/*1.	Збільшити на 10 рейтинг всіх постачальників, рейтинг яких в даний момент менший ніж рейтинг постачальника 4*/
/*2.	Побудувати таблицю, в якій занесено список номерів виробів, що або знаходяться в Лондоні, або для них поставляються деталі яким-небудь постачальником з Лондона*/
/*3.	Видалити всі вироби, для яких немає поставок деталей*/
/*4.	Створити таблицю з номерами постачальників і парами номерів деталей, таких, що кожен з постачальників поставляє обидві вказані деталі*/
/*5.	Збільшити розмір поставки на 10 відсотків для всіх поставок тих постачальників, які поставляють яку-небудь Червону деталь*/
/*6.	Створити таблицю  з комбінаціями «колір деталі -- місто де зберігається деталь» з видаленням дублікатів*/
/*7.	Занести в новостворену таблицю список номерів деталей, які поставляються будь-яким постачальником з Лондона чи для будь-якого виробу з Лондона*/
/*8.	Вставити в таблицю постачальників постачальника з кодом 10, прізвищем Уайт, з міста Нью-Йорк з невідомим рейтингом*/ 
/*9.	Видалити всі вироби з Риму і всі відповідні поставки*/
/*10.	Створити таблицю з впорядкованим списком всіх міст в яких є по крайній мірі один постачальник, одна деталь чи виріб*/
/*11.	Змінити колір червоних деталей з вагою менше 15 фунтів на жовтий.*/
/*12.	Створити таблицю з номерами виробів і назвами міст, де вони виготовляються. Додаткова умова – друга літера назва міста повинна бути ‘о’*/
/*13.	Збільшити на 10 рейтинг тих постачальників, об’єм поставок яких вище середнього*/
/*14.	Створити таблицю з впорядкованими списками номерів і прізвищами постачальників, які постачають деталі для виробу 1.*/
/*15.	Вставити в таблицю двох різних постачальників одною командою*/

--- Merge --- 
/*1.	Створити додаткову таблицю tmp_Details (структура вище) та наповнити її даними*/
/*2.	Написати  команду merge, яка змінить дані у таблиці Details відповідно до вхідних даних таблиці tmp_Details.*/
